ROLE_SYMBOLS = {
    "Основатель": "👑", 
    "Разработчик": "🧑🏻‍💻", 
    "Лидер": "👑", 
    "Президент": "🌟", 
    "Вице-президент": "⭐", 
    "Ветеран": "🎖", 
    "Участник": "👤", 
    "Гость": "🗣️"
}

API_ROLE_TRANSLATION = {
    "president": "Президент", 
    "vicePresident": "Вице-президент", 
    "senior": "Ветеран", 
    "member": "Участник"
}

RANK_NAMES = {
    1: "🥉 Бронза 1", 2: "🥉 Бронза 2", 3: "🥉 Бронза 3", 
    4: "🥈 Серебро 1", 5: "🥈 Серебро 2", 6: "🥈 Серебро 3", 
    7: "🥇 Золото 1", 8: "🥇 Золото 2", 9: "🥇 Золото 3", 
    10: "💎 Алмаз 1", 11: "💎 Алмаз 2", 12: "💎 Алмаз 3", 
    13: "🟣 Мифик 1", 14: "🟣 Мифик 2", 15: "🟣 Мифик 3", 
    16: "🔴 Лега 1", 17: "🔴 Лега 2", 18: "🔴 Лега 3", 
    19: "🟡 Мастер 1", 20: "🟡 Мастер 2", 21: "🟡 Мастер 3", 
    22: "🟢 Про"
}

TIME_UNITS_MAP = {
    "м": 1, "m": 1, "мин": 1, "минут": 1, "минуту": 1, "минута": 1, "минуты": 1,
    "ч": 60, "h": 60, "час": 60, "часа": 60, "часов": 60,
    "д": 1440, "d": 1440, "день": 1440, "дня": 1440, "дней": 1440, "сут": 1440, "сутки": 1440,
    "н": 10080, "w": 10080, "нед": 10080, "неделю": 10080, "недели": 10080, "недель": 10080,
    "мес": 43200, "месяц": 43200, "месяца": 43200, "месяцев": 43200,
    "г": 525600, "y": 525600, "год": 525600, "года": 525600, "лет": 525600
}

IMPLICIT_TIME_MAP = {
    "минута": 1, "минуту": 1, "час": 60, "день": 1440, "сутки": 1440,
    "неделя": 10080, "неделю": 10080, "месяц": 43200, "год": 525600,
    "навсегда": 0, "пермач": 0
}

SAPER_DIFFS = {
    "easy": {"name": "🟢 Легкий", "mines": 5, "mult_step": 0.2, "safe": 20},
    "medium": {"name": "🟡 Средний", "mines": 12, "mult_step": 0.5, "safe": 13},
    "hard": {"name": "🔴 Трудный", "mines": 20, "mult_step": 1.5, "safe": 5}
}

CASINO_EMOJI_MAP = {
    "slot": "🎰", "dice": "🎲", "darts": "🎯", 
    "bowl": "🎳", "fball": "⚽", "bball": "🏀"
}

CASINO_GAME_NAMES = {
    "bj": "🃏 Блэкджек", "slot": "🎰 Слоты", "dice": "🎲 Кости", 
    "darts": "🎯 Дартс", "bowl": "🎳 Боулинг", "fball": "⚽️ Футбол", 
    "bball": "🏀 Баскетбол", "saper": "💣 Сапер"
}

IGNORE_AI_TRIGGERS = [
    "топ", "top", "топ10", "мут", "mute", "анмут", "unmute", "размут", 
    "кик", "kick", "бан", "ban", "разбан", "unban", "слоты", "слот", 
    "кости", "кубик", "dice", "дартс", "darts", "боулинг", "боул", 
    "футбол", "баскетбол", "сапер", "saper", "блекджек", "21", "очко", 
    "баланс", "работа", "ворк", "перевод"
]